/* Размещённый здесь JavaScript код будет загружаться всем пользователям при обращении к каждой странице */

// ============================================================
// Импортирование скриптов из http://dev.wikia.com
importArticles({
    type: 'script',
    articles: [        
		'u:dev:ReferencePopups/code.js',          // Всплывающие примечания
		'u:dev:PurgeButton/code.js',              // Кнопка очистки кэша страницы
		'u:dev:ProfileTags.js'  // Звания участников
    ]
});
// ============================================================