/* Размещённый здесь JavaScript код будет загружаться всем пользователям при обращении к каждой странице */

MastRights = {};
MastRights["Lalka Mega666"] = ["Царь Упортиков","Неактивная Леза","Лалка"];
MastRights["Печенькин21"] = ["Главная Царица Печенек","Смешаный герой"];
MastRights["Камусёночек"] = ["Брат Дерево"];
MastRights[" Grizlik2005"] = ["Хомячок","Главная Хомячиха"];
MastRights["Пельмений"] = ["Пельмень"];
MastRights["Юрий500"] = ["Третий Царь Печенек","Защитник Печенек","Царь Фаниляндии"];
MastRights["Dimavolnovmitya"] = ["Голубь","Ито Митя"];