/* Размещённый здесь код JavaScript будет загружаться пользователям при обращении к каждой странице */

/* Сообщение о блокировке */
var MessageBlock = {
	title : 'Вы были заблокированы!',
	message : 'Привет! Я - администратор Роблокс Крипипаста Вики. Вы были заблокированы по причине "$1" длительностью в $2.<br /><b>Пожалуйста, не пытайтесь обойти блокировку!</b> В противном случае, срок действия блокировки будет продлён. Если вы думаете, что вас заблокировали несправедливо, напишите мне на другой вики либо на своей стене обсуждения (если она не была закрыта).'
};