window.AddRailModule = [
    {page: 'Шаблон:RailModuleSiegeTimer', prepend: true},
    {page: 'Шаблон:RailModule', prepend: true},
];
 
window.BackToTopModern = true;

/* */
/* */
/* Scripts which are imported via [[MediaWiki:ImportJS]] */
/* */
/* Config for [[MediaWiki:gridfiltering.js]] */
/* */
/* */
gridContainer = '#champion-grid'
gridFilters = {
    'name': 'search',
    'role': [ '- Категория -',
        [null, 'Наборы героев'],
        ['Базовые герои', '&nbsp; Базовый набор'],
        ['Герои за изумруды', '&nbsp; Герои за изумруды'],
        ['Скрытые герои', '&nbsp; Скрытые герои'],
        ['Прочие награды', '&nbsp; Прочие награды'],
        ['Герои из осколков', '&nbsp; Герои из осколков'],
        [null, 'Герои за пустоты'],
        ['Духи', '&nbsp; Духи'],
        ['Ангелы', '&nbsp; Ангелы'],
        ['Боги', '&nbsp; Боги'],
        ['Демоны', '&nbsp; Демоны'],
        ['Китайские Боги', '&nbsp; Китайские Боги'],
        [null, 'Тайник с осколками'],
        ['Арбитры', '&nbsp; Арбитры'],
        ['Судьи', '&nbsp; Судьи'],
    ],
    'type': [ '- Награды за... -',
        [null, 'Осады'],
        ['Главные награды','&nbsp; Главные награды'],
        ['230млн очков','&nbsp; 230млн очков'],
        ['4млн очков','&nbsp; 4млн очков'],
        [null, 'События'],
        ['Главные собития','&nbsp; Главные награды'],
        ['Вторичные награды','&nbsp; Вторичные награды'],
        [null, 'ПвП Лига'],
        ['Главные Лига','&nbsp; Главные награды'],
    ],
}