nkch_gst_gadgets = [{
    name: "NavEmerald", // название гаджета с MediaWiki:Gadgets-definition; обязательно
    title: "Мини глобал-меню", // Название в меню
    description: "Переносит кнопки в правый верхний угол, удаляя всё лишнее" // Описание гаджета в меню при наведении
},

{
    name: "Font1", // название гаджета с MediaWiki:Gadgets-definition; обязательно
    title: "Системный шрифт (Chromium)", // Название в меню
    description: "Заменяет шрифт на всей вики на системный (только для chromium браузеров)" // Описание гаджета в меню при наведении
},];