// <nowiki>
CRA.i18n.sr = {
	pageTitle: 'Аутоматско ажурирање преименованих категорија',
	categoryNamespace: 'Категорија',
	rename: 'Преименуј',
	reason: 'Разлог',
	automatic: 'аутоматски',
	failedItems: 'Неуспели предмети',
	renameFieldset: 'Преименуј категорију',
	currentName: 'Тренутно име',
	leaveRedir: 'Остави преусмерење',
	replaceOldContents: 'Замени стари садржај',
	deleteOldCat: 'Обриши стару категорију',
	doNothing: 'Не ради ништа од наведеног',
	checkingNewTitle: 'Проверавање да ли нова страница постоји',
	gettingCatMembers: 'Тражење чланова категорије',
	fetchingContents: 'Сакупљање садржаја страница',
	creatingNewPage: 'Прављење нове странице',
	submittingPages: 'Покрени чување страница',
	renameComplete: 'Преименовање успело. Нова категорија',
	catNotUsed: 'Категорија се не користи ни на једној страници, преименуј ручно.',
	destExists: 'Страница већ постоји.',
	renamingCat: 'Преименовање категорије',
	createdNewCat: 'Направљена нова категорија',
	unableToCreate: 'Неуспех при стварању категорије',
	updating: 'Ажурирање',
	redirToNew: 'Преусмерење до нове категорије',
	submittedPage: 'Сачувана страница',
	mainDescription: 'Користећи форму испод можете преименовати категорију и заменити појављивања категорије на осталим страницама. Можете одлучити шта ћете радити са старим категоријама, и нова категорија са садржајем првобитне ће бити направљена. Уверите се да сте проверили <a href="/wiki/Посебно:ТраженеКатегорије">тражене категорије</a>. Ви сте дужни да се уверите да везе и даље воде до места на које би требало.<br /><br />Страница <strong>неће</strong> бити померена уколико већ постоји страница под траженим именом.<br /><br /><strong>Упозорење!</strong> Ово може бити драстично и неочекивано за препуне категорије; будите сигурни да разумете последице овога пре настављања.',
	failedDescription: 'Неуспеле ствари се налазе овде. Странице на којима је категорија додавана помоћу шаблона ће се појавити овде, такође.',
	chooseOldPage: 'Изаберите шта желите да урадите са старом категоријом',
	includeLinks: 'Укључи <span style="font-weight: bold">везе</span> из свих именских простора нпр: [[:Категорија:Име категорије]] <span style="font-size: 9px;">(подразумевано укључује главни именски простор)</span>',
	pageNotCreated: [
		'Категорија',
		/* New Category Name */
		'није могла бити направљена. Код грешке:'
		/* Error Code */
	],
	pageNotSubmitted: [
		'Страница',
		/* Page Name */
		'није могла бити сачувана. Код грешке:',
		/* Error Code */
		'Молимо вас да ажурирате везе на тој страници ручно'
	],
	pageNotDeleted: [
		'Страница',
		/* Page Name */
		'није могла бити обрисана. Код грешке:',
		/* Error Code */
		'Молимо вас да обришете страницу ручно'
	],
	unableToFind: [
		'Неуспех при проналажењу',
		/* Old Category Name */
		'на страници',
		/* Page Name */
		'; можда се додаје преко шаблона. Молимо вас да ажурирате категорије ручно'
	]
};
// </nowiki>