//<nowiki>

CRA.i18n.kn= {
	pageTitle: 'CategoryRenameAuto-update',
	categoryNamespace: 'ವರ್ಗ',
	rename: 'ಮರುಹೆಸರಿಸು',
	reason: 'ಕಾರಣ',
	automatic: 'ಸ್ವಯಂಚಾಲಿತ',
	failedItems: 'ವಿಫಲವಾಗಿದೆ ಐಟಂಗಳನ್ನು',
	renameFieldset: 'ವರ್ಗದಲ್ಲಿ ಮರುಹೆಸರಿಸು',
	currentName: 'ಪ್ರಸ್ತುತ ಹೆಸರು',
	leaveRedir: 'ಹಿಂದೆ ಪುನರ್ನಿರ್ದೇಶಿತ ಬಿಡಿ',
	replaceOldContents: 'ವಿಷಯಗಳ ಬದಲಾಯಿಸಿ',
	deleteOldCat: 'ಹಳೆಯ ವರ್ಗದಲ್ಲಿ ಅಳಿಸಿ ಹಾಕು',
	doNothing: 'ಮೇಲೆ ಯಾವುದೇ ಡು',
	checkingNewTitle: 'ಹೊಸ ಶೀರ್ಷಿಕೆ ಅಸ್ತಿತ್ವದಲ್ಲಿದ್ದರೆ ಪರಿಶೀಲಿಸಲಾಗುತ್ತಿದೆ',
	gettingCatMembers: 'ಗೆಟ್ಟಿಂಗ್ ವರ್ಗದಲ್ಲಿ ಸದಸ್ಯರ',
	fetchingContents: 'API ನಿಂದ ಪಡೆಯಲಾಗುತ್ತಿದೆ ಪುಟ ವಿಷಯಗಳ',
	creatingNewPage: 'ಹೊಸ ಪುಟ ರಚಿಸಲಾಗುತ್ತಿದೆ',
	submittingPages: 'ಪುಟಗಳು ಸಲ್ಲಿಸುವ ಆರಂಭಿಸಲು',
	renameComplete: 'ಸಂಪೂರ್ಣ ಮರುಹೆಸರಿಸು. ಹೊಸ ವರ್ಗದಲ್ಲಿ ',
	catNotUsed: 'ಯಾವುದೇ ಪುಟಗಳಲ್ಲಿ ಬಳಸಲಾಗುವುದಿಲ್ಲ ವರ್ಗ ಕೈಯಾರೆ ಮರುಹೆಸರಿಸಲು.',
	destExists: 'ಗಮ್ಯಸ್ಥಾನದ ಹೆಸರು ಈಗಾಗಲೇ ಅಸ್ತಿತ್ವದಲ್ಲಿದೆ.',
	renamingCat: 'ಮರುಹೆಸರಿಸಲಾಗುತ್ತಿದೆ ವರ್ಗ',
	createdNewCat: 'ರಚಿಸಲಾಗಿದೆ ಹೊಸ ವರ್ಗದಲ್ಲಿ ಪುಟ',
	unableToCreate: 'ವರ್ಗದಲ್ಲಿ ರಚಿಸಲು ಸಾಧ್ಯವಾಗಿಲ್ಲ',
	updating: 'ನವೀಕರಿಸಲಾಗುತ್ತಿದೆ',
	redirToNew: 'ಹೊಸ ವರ್ಗದಲ್ಲಿ ಮರುನಿರ್ದೇಶಿಸಲಾಗುತ್ತದೆ',
	submittedPage: 'ಸಲ್ಲಿಸಿದ ಪುಟ ',
	mainDescription: 'ಕೆಳಗಿನ ಫಾರ್ಮ್ ಬಳಸಿ ವರ್ಗದಲ್ಲಿ ಬಳಸಲಾಗುತ್ತದೆ ಪುಟಗಳಲ್ಲಿ ವರ್ಗದಲ್ಲಿ ಹೆಸರುಗಳು ಬದಲಾವಣೆ ವಿಭಾಗ ಬದಲಾಯಿಸಲು ಕಾಣಿಸುತ್ತದೆ. ನೀವು ಹಳೆಯ ವರ್ಗದಲ್ಲಿ ಪುಟಗಳು ಏನು ಮಾಡಬೇಕೆಂದು ನಿರ್ಧರಿಸಲು, ಮತ್ತು ಹೊಸ ವರ್ಗದಲ್ಲಿ ಪುಟ ಹಳೆಯ ವರ್ಗದಲ್ಲಿ ವಿಷಯದೊಂದಿಗೆ ನಿರ್ಮಿಸಲಾಗುತ್ತದೆ. <a href="' + mw.util.getUrl('Special:WantedCategories') + '"> ಬೇಕಾಗಿದ್ದಾರೆ ವಿಭಾಗಗಳು </a> ಪರೀಕ್ಷಿಸಲು ಮರೆಯದಿರಿ. ಅವರು ಹೋಗಿ ಸೇರಬೇಕೆಂದು ಅಲ್ಲಿ ಕೊಂಡಿಗಳು ತೋರಿಸಲು ಮುಂದುವರೆಯಲು ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಲು ಹೊಣೆ. <br /> <br /> ಗಮನಿಸಿ ಪುಟ <strong> </ strong> ಹೊಸ ಈಗಾಗಲೇ ಒಂದು ಪುಟ ವೇಳೆ ಸರಿಸಲಾಗುವುದು ಎಂದು . ಶೀರ್ಷಿಕೆ <br /> <br /> <ಬಲವಾದ> ಎಚ್ಚರಿಕೆ </ strong> ಈ ಜನಪ್ರಿಯ ವರ್ಗದ ತೀವ್ರ ಮತ್ತು ಅನಿರೀಕ್ಷಿತ ಎಂದು; ದಯವಿಟ್ಟು ನೀವು ಮುಂದುವರಿಯುವುದಕ್ಕೆ ಮುಂಚಿತವಾಗಿ ಈ ಪರಿಣಾಮಗಳನ್ನು ಅರ್ಥಮಾಡಿಕೊಳ್ಳಲು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ. ',
	failedDescription: 'ವಿಫಲವಾಗಿದೆ ಐಟಂಗಳನ್ನು ಮರಣದಂಡನೆ ನಂತರ ಇಲ್ಲಿ ಕಾಣಿಸಿಕೊಳ್ಳುತ್ತವೆ. ವರ್ಗದಲ್ಲಿ ತಿನ್ನುವೆ ಒಂದು ಟೆಂಪ್ಲೇಟ್ ಮೂಲಕ transcluded ಇದೆ ಪುಟಗಳನ್ನು ಸಹ ತಪ್ಪಾಗಿ ಇಲ್ಲಿ ಕಂಡುಬರುವ ಗಮನಿಸಿ. ',
	chooseOldPage: 'ಹಳೆಯ ವರ್ಗದಲ್ಲಿ ಪುಟ ಮಾಡಬೇಕೆಂದು ಆರಿಸಿ',
	includeLinks: 'Include <span style="font-weight: bold">ಕೊಂಡಿಗಳು</span> ಎಲ್ಲಾ ನಾಮಸ್ಥಳಗಳು ಉದಾ: [[: ವರ್ಗ: ವರ್ಗ ಹೆಸರು]]: <span style="font-size: 9px;">(ಕೇವಲ ಪೂರ್ವನಿಯೋಜಿತವಾಗಿ ಮುಖ್ಯ ಒಳಗೊಂಡಿದೆ)</span>',
	pageNotCreated: [
		'ಪುಟ',
		/* New Category Name */
		'ಈ ಕಾರಣದಿಂದ ದೋಷ ಕೋಡ್ ನಿರ್ಮಿಸಲಾಗುತ್ತದೆ'
		/* Error Code */
	],
	pageNotSubmitted: [
		'ಪುಟ',
		/* Page Name */
		'ಈ ಕಾರಣದಿಂದ ದೋಷ ಕೋಡ್ ಸಲ್ಲಿಸಿದ ಸಾಧ್ಯವಿಲ್ಲ',
		/* Error Code */
		'ದಯವಿಟ್ಟು ಕೈಯಾರೆ ಆ ಪುಟದ ಲಿಂಕ್ (ಗಳು) ಅಪ್ಡೇಟ್ ಮಾಡಬಹುದು'
	],
	pageNotDeleted: [
		'ಪುಟ',
		/* Page Name */
		'ಈ ಕಾರಣದಿಂದ ದೋಷ ಕೋಡ್ ಅಳಿಸಲ್ಪಡುತ್ತದೆ'
		/* Error Code */
		'ದಯವಿಟ್ಟು ಕೈಯಾರೆ ಪುಟ ಅಳಿಸಲು'
	],
	unableToFind: [
		'ಕಾಣಬರಲಿಲ್ಲ'
		/* Old Category Name */
		'ಪುಟದಲ್ಲಿ'
		/* Page Name */
		'; ಇದು ಟೆಂಪ್ಲೇಟ್ ಮೂಲಕ transcluded ಮಾಡಬಹುದು. ಪರಿಶೀಲಿಸಿ ಮತ್ತು ಅಗತ್ಯವಿದ್ದರೆ ಕೈಯಾರೆ ನವೀಕರಿಸಿ. '
	]
}

//</nowiki>