//__NOWYSIWYG__ <source lang="javascript">
//<nowiki>

CRA.i18n.uk = {
	pageTitle: 'CategoryRenameAuto-update',
	categoryNamespace: 'Категорія',
	rename: 'Перейменувати',
	reason: 'Причина',
	automatic: 'автоматично',
	failedItems: 'Помилкові елементи',
	renameFieldset: 'Перейменувати категорії',
	currentName: 'Поточна назва',
	leaveRedir: 'Залишити перенаправлення під колишньою назвою',
	replaceOldContents: 'Редагувати вміст',
	deleteOldCat: 'Видалити стару категорію',
	doNothing: 'Нічого не змінювати',
	checkingNewTitle: 'Перевірка нової назви на наявність на вікі',
	gettingCatMembers: 'Завантаження назв',
	fetchingContents: 'Завантаження вмісту сторінок з API',
	creatingNewPage: 'Створення нової сторінки',
	submittingPages: 'Почати збереження сторінок',
	renameComplete: 'Зміну назви завершено. Нова категорія',
	catNotUsed: 'Категорія не використовується на жодній сторінці, перейменуйте категорії вручну.',
	destExists: 'Дана назва вже існує.',
	renamingCat: 'Перейменування категорії',
	createdNewCat: 'Нову категорію створено',
	unableToCreate: 'Неможливо створити категорії',
	updating: 'Оновлення',
	redirToNew: 'Перенаправити на нову категорію',
	submittedPage: 'Сторінку збережено',
	mainDescription: 'Використовуючи форму нижче, ви можете змінити назву категорії, змінивши назву категорії на сторінках, що входять в цю категорію. Ви можете вирішити, що зробити зі старими сторінками категорій; нова сторінка категорії створюється з вмістом старої категорії. Не забудьте переглянути <a href="' + mw.util.getUrl('Special:WantedCategories') + '">список необхідних категорій</a>. Ви несете відповідальність за коректну роботу посилань.<br /><br />Слід мати на увазі, що сторінку <strong>не</strong> буде перенесено, якщо вже є сторінка з новим ім\'ям.<br /><br /><strong>Увага!</strong> Використання скрипта може призвести до несподіваних наслідків для популярних категорій, перед перейменуванням рекомендується перевірити коректність внесених змін.',
	failedDescription: 'Помилкові елементи з\'являться тут після очищення. Слід мати на увазі, що сторінки, які потрапляють в категорію з допомогою шаблону, також з\'являться тут.',
	chooseOldPage: 'виберіть, що зробити зі старою категорією',
	includeLinks: 'Містить <span style="font-weight: bold">посилання</span> у всіх просторах імен, наприклад: [[:Категорія:Назва категорії]] <span style="font-size: 9px;">(включає в себе (основне) за замовчуванням)</span>',
	pageNotCreated: [
		'Сторінку',
		/* New Category Name */ 
		'не може бути створено, тому що'
		/* Error Code */
	],
	pageNotSubmitted: [
		'Сторінку',
		/* Page Name */ 
		'не може бути збережено, тому що',
		/* Error Code */
		'Будь ласка, поновіть посилання на сторінку вручну.'
	],
	pageNotDeleted: [
		'Сторінку',
		/* Page Name */ 
		'не може бути вилучено через',
		/* Error Code */
		'Будь ласка, видаліть сторінку вручну.'
	],
	unableToFind: [
		'Не вдається знайти',
		/* Old Category Name */
		'на сторінці',
		/* Page Name */
		'; може бути додано за допомогою шаблону. Будь ласка, перевірте та оновіть вручну в разі необхідності.'
	]
}

//</nowiki>
//</source>