//__NOWYSIWYG__ <source lang="javascript">
//<nowiki>
 
CRA.i18n.el = {
	pageTitle: 'ΚατηγορίαΜετονομασίαΑυτόματη-αναβάθμιση',
	categoryNamespace: 'Κατηγορία',
	rename: 'Μετονομασία',
	reason: 'Λόγος',
	automatic: 'Αυτόματο',
	failedItems: 'Αποτυχημένα Αντικείμενα',
	renameFieldset: 'Μετονομασία Κατηγορίας',
	currentName: 'Τρέχον Όνομα',
	leaveRedir: 'Άφησε μια ανακατεύθυνση πίσω',
	replaceOldContents: 'Αντικατέστησε το υλικό',
	deleteOldCat: 'Διέγραψε τη παλία κατηγορία',
	doNothing: 'Μη κάνεις τίποτα απο τα παραπάνω',
	checkingNewTitle: 'Έλεγξε εάν ο νέος τίτλος υπάρχει',
	gettingCatMembers: 'Παίρνοντας μέλη κατηγοριών',
	fetchingContents: 'Προκαλέστε σελίδα υλικού απο το API',
	creatingNewPage: 'Δημιουργώντας νέα σελίδα',
	submittingPages: 'Αρχή υποβολής σελίδων',
	renameComplete: 'Η Μετονομασία ολοκληρώθηκε. Νέα κατηγορία',
	catNotUsed: 'Η Κατηγορία δε χρησιμοποιείται σε καμία σελίδα. Μετονομάστε χειροκίνητα',
	destExists: 'Το όνομα προορισμού υπάρχει ήδη.',
	renamingCat: 'Μοτονομάζοντας κατηγορία',
	createdNewCat: 'Δημιουργήθηκε νέα σελίδα κατηγορίας',
	unableToCreate: 'Δε γίνεται να δημιουργηθεί κατηγορία',
	updating: 'Αναβαθμίζοντας',
	redirToNew: 'Ανακατεύθυνση σε νέα κατηγορία',
	submittedPage: 'Υποβολή σελίδας',
	mainDescription: 'Χρησιμοποιόντας τη φόρμα παρακάτω θα μετονομάσετε μια κατηγορίαμε το να αλλάξετε το όνομα των κατηγοριών στις σελίδες που η κατηγορία χρησιμοποιείται. Μπορείτε να αποφασίσετε τι να κάνετε με τις σελίδες παλιών κατηγοριών και μια νέα σελίδα κατηγορίας θα δημιουργηθεί με υλικό απο τη παλιά κατηγορία. Να είστε σίγουροι πως ελέγξατε <a href="' + mw.util.getUrl('Special:WantedCategories') + '">επιθυμητές κατηγορίες</a>. Είστε υπεύθυνος για να διατηρήσετε την λειτουργικότητα των συνδέσμων<br /><br />Δώστε σημασία στο ότι η σελίδα <strong>δεν</strong> θα μετακινηθεί εάν υπάρχει ήδη μια σελίδα στο νέο τίτλο.<br /><br /><strong>Προειδοποίηση!</strong> Αυτό μπορεί να είναι δραστικό και απρόβλεπτο για μια δημοφιλή κατηγορία, παρακαλούμε να είστε σίγουρος ότι καταλάβατε τις συνέπειες προτού προχωρήσετε.',
	failedDescription: 'Αποτυχημένα αντικείμενα εμφανίζονται εδώ μετά την εκτέλεση Δώστε προσοχή στο ότι οι σελίδες στις οποίες η κατηγορία περιέχεται μέσω ενός προτύπο θα εμφανίζεται εδώ λανθασμένα.',
	chooseOldPage: 'Επιλέξτε τι να κάνετε με τη παλιά σελίδα κατηγορίας',
	includeLinks: 'Περιλαμβάνε<span style="font-weight: bold">σύνδεσμοι</span> σε όλα τα κενά μεταξύ ονομάτων πχ: [[:Κατηγορία:Κατηγορία ονόματος]] <span style="font-size: 9px;">(περιέχει μόνο Κύριο προκαθορισμένο)</span>',
	pageNotCreated: [
		'Η σελίδα',
		/* New Category Name */ 
		'δε μπορούσε να δημιουργηθεί λόγω του λανθασμένου κώδικα'
		/* Error Code */
	],
	pageNotSubmitted: [
		'Η σελίδα',
		/* Page Name */ 
		'δεν μπόρεσε να υποβληθεί λόγω του λανθασμένου κώδικα',
		/* Error Code */
		'Παρακαλούμε αναβαθμίστε το σύνδεσμο(ους) σε αυτή τη σελίδα χειροκίνητα'
	],
	pageNotDeleted: [
		'Η σελίδα',
		/* Page Name */ 
		'δεν μπόρεσε να διαγραφεί λόγω του λανθασμένου κώδικα',
		/* Error Code */
		'Παρακαλώ διαγράψτε τη σελίδα χειροκίνητα'
	],
	unableToFind: [
		'Δεν μπόρεσε να βρεθεί',
		/* Old Category Name */
		'στη σελίδα',
		/* Page Name */
		'; Μπορεί να περιέχεται μέσω προτύπο. Παρακαλούμε ελέξτε και αναβαθμίστε χειροκίνητα εάν χρειαστεί.'
	]
}
 
//</nowiki>
//</source>