//__NOWYSIWYG__ <source lang="javascript">
//<nowiki>

CRA.i18n.be = {
	pageTitle: 'CategoryRenameAuto-update',
	categoryNamespace: 'Катэгорыя',
	rename: 'Пераназваць',
	reason: 'Прычына',
	automatic: 'аўтаматычна',
	failedItems: 'Хібныя элементы',
	renameFieldset: 'Пераназваць катэгорыі',
	currentName: 'Бягучая назва',
	leaveRedir: 'Пакінуць перанакіраванне пад ранейшай назвай',
	replaceOldContents: 'Змяніць змесціва',
	deleteOldCat: 'Выдаліць старую катэгорыю',
	doNothing: 'Нічога не змяняць',
	checkingNewTitle: 'Праверка новай назвы на наяўнасць на вікі',
	gettingCatMembers: 'Загрузка назваў',
	fetchingContents: 'Загрузка змесціва старонак з API',
	creatingNewPage: 'Стварэнне новай старонкі',
	submittingPages: 'Пачаць захаванне старонак',
	renameComplete: 'Змена назвы завершана. Новая катэгорыя',
	catNotUsed: 'Катэгорыя не выкарыстоўваецца ні на адной старонцы, пераназавіце катэгорыі ручна.',
	destExists: 'Дадзеная назва ўжо існуе.',
	renamingCat: 'Пераназванне катэгорыі',
	createdNewCat: 'Новая катэгорыя створана',
	unableToCreate: 'Немагчыма стварыць катэгорыі',
	updating: 'Абнаўленне',
	redirToNew: 'Перанакіраваць на новую катэгорыю',
	submittedPage: 'Старонка захавана',
	mainDescription: 'Скарыстаючы форму ніжэй, вы можаце змяніць назву катэгорыі, змяніўшы назву катэгорыі на старонках, што ўваходзяць у гэту катэгорыю. Вы можаце вырашыць, што зрабіць са старымі старонкамі катэгорый; новая старонка катэгорыі ствараецца са змесцівам старой катэгорыі. Не забудзьцеся прагледзець <a href="' + mw.util.getUrl('Special:WantedCategories') + '">спіс патрабаваных катэгорый</a>. Вы несяце адказнасць за карэктную працу спасылак.<br /><br />Варта мець на ўвазе, што старонка <strong>не</strong> будзе перанесена, калі ужо ёсць старонка з новым імем.<br /><br /><strong>Увага!</strong> Выкарыстанне скрыпту можа прывесці да нечаканых наступстваў для папулярных катэгорый, перад пераназваннем рэкамендуецца праверыць карэктнасць уносных змен.',
	failedDescription: 'Хібныя элементы з\'явяцца тут пасля ачысткі. Варта мець на ўвазе, што старонкі, якія трапляюць у катэгорыю з дапамогай шаблону, таксама з\'явяцца тут.',
	chooseOldPage: 'выберыце, што зрабіць са старой катэгорыяй',
	includeLinks: 'Утрымвае <span style="font-weight: bold">спасылкі</span> ва ўсіх прасторах імёнаў, прыкладам: [[:Катэгорыя:Назва катэгорыі]] <span style="font-size: 9px;">(складаецца з (асноўнае) па змаўчанні)</span>',
	pageNotCreated: [
		'Старонка',
		/* New Category Name */ 
		'не можа быць створана, таму што'
		/* Error Code */
	],
	pageNotSubmitted: [
		'Старонка',
		/* Page Name */ 
		'не можа быць захавана, таму што',
		/* Error Code */
		'Калі ласка, абновіце спасылку(і) на старонцы ручна.'
	],
	pageNotDeleted: [
		'Старонка',
		/* Page Name */ 
		'не можа быць выдалена з-за',
		/* Error Code */
		'Калі ласка, выдаліце старонку ручна.'
	],
	unableToFind: [
		'Не атрымоўваецца знайсці',
		/* Old Category Name */
		'на старонцы',
		/* Page Name */
		'; можа быць дададзена з дапамогай шаблону. Калі ласка, праверце і абнавіце ручна ў выпадку патрэбы.'
	]
}

//</nowiki>
//</source>