LIR.i18n.be= {
	queueModalTitle: 'Чарга абнаўлення імёнаў файлаў',
	fileNamespace: 'Выява',
	imageNamespace: 'Малюнак',
	videoNamespace: 'Відэа', //No longer allowed alias. I don't know what it was in the past, but I might as well try to guess something. What can possibly go wrong?
	using: 'Выкарыстанне', //Replaced from "Using" - needs testing for context
	queue: 'Чарга',
	userBlogCommentNamespace: 'User blog comment',
	editSummary: 'Абнаўленне імёнаў файлаў (аўтаматычнае)',
	filesInQueue: 'Файлы ў чарзе',
	oldFileName: 'Старое імя файла',
	newFileName: 'Новае імя файла',
	addToQueue: 'Дадаць у чаргу',
	nameInUse: 'Імя прызначэння ўжо выкарыстоўваецца або знаходзіцца ў чарзе для выкарыстання.',
	alreadyInQueue: 'Файл ужо знаходзіцца ў чарзе.',
	invalidExtension: 'Няправільнае пашырэнне файла.',
	blogComment: 'Файл выкарыстоўваецца ў каментарах да блога. Абнаўленне немагчыма.',
	fileNotUsed: 'Файл не выкарыстоўваецца ні на адной старонцы.',
	noQueueExists: 'Няма ніякай чаргі для запуску',
	itemRemoved: 'Выдалена з чаргі',
	destInUse: 'Імя прызначэння ўжо занята.',
	processing: 'Праца ў працэсе',
	successful: 'Завершана паспяхова.',
	varsUndef: 'Не вызначаны зменныя. Праверце код.',
	queueComplete: 'Выкананне чаргі завершана',
	queueStarted: 'Чарга запушчана',
	contentsRetrieved: 'Змесціва старонкі загружана і захавана',
	queueUpdate: 'Чарга абноўлена',
	nothingInQueue: 'Чарга пустая.',
	tryDiffName: 'Калі ласка, увядзіце імя файла.',
	waitCleared: 'Спіс старонак, якія чакаюць, ачышчаны',
	toUndef: 'Пераменная „To” не была паказаная.',
	fileNameBlank: 'Імя файла не можа быць пустым',
	submittingContent: 'Захаванне старонкі',
	namespaceCheckbox: 'Ўлічваюцца <span style="font-weight: bold">спасылкі</span> ва ўсіх прасторах, напрыклад, [[:Выява:Выява.png]] <span style="font-size: 9px;">(па змаўчанні толькі ў асноўным прасторы)</span>',
	failedDescription: 'Тут будуць улічаны любыя няўдалыя замены. Выявы ў шаблонах могуць выклікаць ілжывыя трывогі.',
	pagesWaiting: 'Па-ранейшаму выяўленыя старонкі, якія чакаюць дадання ў чаргу. Калі гэта не так, калі ласка, выкарыстоўвайце кнопку „Скінуць спіс”.',
	unableToMoveChoose: 'Калі ласка, абярыце іншае імя для гэтага файла.',
	unableToMoveFail: /* Image name */ 'быў выдалены з чаргі.',
	singleButtonText: 'Перамясціць і замяніць',
	queueButtonText: 'Дадаць у чаргу',
	fileInQueue: 'Гэты файл ўжо знаходзіцца ў чарзе на перайменаванне.',
	removeFromQueue: 'Выдаліць з чаргі',
	queueModalClose: 'Зачыніць',
	queueModalManual: 'Дадаць ўручную',
	queueModalReset: 'Скінуць спіс',
	queueModalUpdate: 'Абнавіць',
	queueModalExecute: 'Запусціць',
	queueAddition: 'Ручное даданне ў чаргу',
	manualModalDescription: 'Калі ласка, увядзіце імя файла (магчыма, неіснуючае) для ручнога абнаўлення. Толькі спасылкі на старонках будуць замененыя, а сам файл <span style="font-weight: bold">не будзе</span>, нават калі павінен ці ёсць замена. Карысна для аднаўлення чырвоных спасылак і замены аднаго файла іншым (напрыклад, у выпадку паўтаральных запісаў)',
	
	queueModalWaitConfirm: [
		'Гэтая опцыя скіне спіс старонак, якія чакаюць дадання ў чаргу ў выпадку ўзнікнення праблем з апрацоўкай старонкі, якія замінаюць апрацоўваць файлы з чаргі.',
		'Колькасць старонак у чарзе на даданне ў чаргу:',
		/* Number of pages */
		'',
		'Націсніце „OK”, каб працягнуць. Любыя незавершаныя спробы дадаць файлы ў чаргу павінны быць паўтораны пасля абнаўлення старонкі.'
	],
	waitList: [
		'Пазіцыя №',
		/* number on waitlist */
		'у спісе чакаючых'
	],
	unableToFind: [
		'',
		/* Image Name */
		'не быў знойдзены на старонцы',
		/* Page Name */
		'але ён мог быць уключаны праз шаблон. Праверце ўручную ў выпадку неабходнасці.'
	],
	unableToMove: [
		'Імя файла',
		/* Image Name */
		'не можа быць зменена на',
		/* Image Name */
		'па наступнай прычыне:'
		/* error code */
	],
	unableToSubmit: [
		'Старонка',
		/* Page Name */
		'не можа быць захавана з-за памылкі:',
		/* Image Name */
		'Калі ласка, абновіце спасылкі ўручную.'
	],
	movePageNamespaceSelect: [
		'ўплывае толькі на параметр',
		/* Single button name */
		''
	],
	movePageDescription: [
		'Кнопка',
		/* Single button name */
		'абновіць усе артыкулы з новым імем файла пры націску на кнопку',
		/* Multi button name */
		'дадае файл у чаргу так, каб у выпадку змены некалькіх файлаў у адным артыкуле яны былі абноўленыя адначасова. Чарга можа быць адлюстравана на любой старонцы файла ў меню, якое расчыняецца, побач з кнопкай "Правіць". Дадзеныя з чаргі захоўваюцца толькі для аднаго браўзэра і не пераходзяць на іншыя браўзэры або кампутары.'
	],
	
	movePageInfo: [
		'Скрыпт абноўлены',
		/* date */
		'Больш інфармацыі аб абнаўленнях і функцыях вы знойдзеце <a href="//dev.wikia.com/wiki/FileUsageAuto-update">тут</a>. Просім падрабязна апісваць памылкі і прапушчаныя змены імёнаў файлаў на старонцы абмеркавання.'
	]
};