LIR.i18n.uk= {
	queueModalTitle: 'Черга оновлення імен файлів',
	fileNamespace: 'Файл',
	imageNamespace: 'Зображення',
	videoNamespace: 'Відео', //No longer allowed alias. I don't know what it was in the past, but I might as well try to guess something. What can possibly go wrong?
	using: 'Використання', //Replaced from "Using" - needs testing for context
	queue: 'Черга',
	userBlogCommentNamespace: 'Коментар до блога користувача',
	editSummary: 'Оновлення імен файлів (автоматичне)',
	filesInQueue: 'Файли в черзі',
	oldFileName: 'Старе ім\'я файлу',
	newFileName: 'Нове ім\'я файлу',
	addToQueue: 'Додати в чергу',
	nameInUse: 'Ім\'я призначення вже використовується або знаходиться у черзі для використання.',
	alreadyInQueue: 'Файл вже знаходиться в черзі.',
	invalidExtension: 'Неправильне розширення файлу.',
	blogComment: 'Файл використовується в коментарях до блогу. Оновлення неможливо.',
	fileNotUsed: 'Файл не використовується на жодній сторінці.',
	noQueueExists: 'Немає ніякої черги для запуску',
	itemRemoved: 'Видалено з черги',
	destInUse: 'Ім\'я призначення вже зайнято.',
	processing: 'Робота у процесі',
	successful: 'Завершено успішно.',
	varsUndef: 'Не визначені змінні. Перевірте код.',
	queueComplete: 'Виконання черзі завершено',
	queueStarted: 'Чергу запущено',
	contentsRetrieved: 'Зміст сторінки завантажено та збережено',
	queueUpdate: 'Чергу оновлено',
	nothingInQueue: 'Черга порожня.',
	tryDiffName: 'Будь ласка, введіть ім\'я файлу.',
	waitCleared: 'Список чекаючих сторінок очищений',
	toUndef: 'Змінна „To” не була вказана.',
	fileNameBlank: 'Ім\'я файлу не може бути порожнім',
	submittingContent: 'Збереження сторінки',
	namespaceCheckbox: 'Враховуються <span style="font-weight: bold">посилання</span> у всіх просторах, наприклад, [[:Файл:Файл.png]] <span style="font-size: 9px;">(за замовчуванням тільки в основному просторі)</span>',
	failedDescription: 'Тут враховуватимуться будь-які невдалі заміни. Зображення в шаблонах можуть викликати помилкові тривоги.',
	pagesWaiting: 'Раніше виявлені сторінки, які очікують додавання в чергу. Якщо це не так, будь ласка, використовуйте кнопку „Скинути список”.',
	unableToMoveChoose: 'Будь ласка, виберіть інше ім\'я цього файлу.',
	unableToMoveFail: /* Image name */ 'був видалений з черги.',
	singleButtonText: 'Перемістити та замінити',
	queueButtonText: 'Додати в чергу',
	fileInQueue: 'Цей файл знаходиться в черзі на перейменування.',
	removeFromQueue: 'Видалити з черги',
	queueModalClose: 'Закрити',
	queueModalManual: 'Додати вручну',
	queueModalReset: 'Скинути список',
	queueModalUpdate: 'Оновити',
	queueModalExecute: 'Запустити',
	queueAddition: 'Ручне додавання в чергу',
	manualModalDescription: 'Введіть ім\'я файлу (можливо, неіснуюче) для ручного оновлення. Тільки посилання на сторінках замінятимуться, а сам файл <span style="font-weight: bold">не буде</span>, навіть якщо має чи є заміна. Корисно для відновлення червоних посилань і заміни одного файлу іншим (наприклад, у випадку повторюваних записів)',
	
	queueModalWaitConfirm: [
		'Ця опція скине список сторінок, які очікують додавання в чергу в разі виникнення проблем з обробкою сторінки, які заважають обробляти файли із черги.',
		'Кількість сторінок в черзі на додавання в чергу:',
		/* Number of pages */
		'',
		'Натисніть „OK”, щоб продовжити. Будь-які незавершені спроби додати файли в чергу повинні бути повторені після оновлення сторінки.'
	],
	waitList: [
		'Позиція №',
		/* number on waitlist */
		'в списку очікуючих'
	],
	unableToFind: [
		'',
		/* Image Name */
		'не був знайдений на сторінці',
		/* Page Name */
		'але він міг бути включений через шаблон. Перевірте вручну в разі необхідності.'
	],
	unableToMove: [
		'Ім\'я файлу',
		/* Image Name */
		'не може бути змінено на',
		/* Image Name */
		'з наступної причини:'
		/* error code */
	],
	unableToSubmit: [
		'Сторінка',
		/* Page Name */
		'не може бути збережена через наступну помилку:',
		/* Image Name */
		'Будь ласка, поновіть посилання вручну.'
	],
	movePageNamespaceSelect: [
		'впливає тільки на параметр',
		/* Single button name */
		''
	],
	movePageDescription: [
		'Кнопка',
		/* Single button name */
		'оновить всі статті з новим ім\'ям файлу при натисканні на кнопку',
		/* Multi button name */
		'додає файл в чергу так, щоб у разі зміни декількох файлів в одній статті вони були оновлені одночасно. Чергу може бути відображено на будь-якій сторінці файлу в розкривному списку поруч із кнопкою "Редагувати". Дані з черги зберігаються тільки для одного браузера і не переходять на інші браузери або комп\'ютери.'
	],
	
	movePageInfo: [
		'Скрипт оновлено',
		/* date */
		'Більше інформації про оновлення та функції ви знайдете <a href="//dev.wikia.com/wiki/FileUsageAuto-update">тут</a>. Просимо детально описувати помилки та пропущені зміни імен файлів на сторінці обговорення.'
	]
};