/**********************************************************************************************/
/*** CustomGalleryButton by RyaNayR; Cqm; Prince(ss) Platinum; Bobogoobo; AnimatedCartoons; ***/
/**********************************************************************************************/
(function ($) {
    if ($('.wikia-photogallery-add').length) {
        var galleryButtonText = window.galleryButtonText || 'Додати фото / Редагувати галереї',
            galleryButtonIcon = window.galleryButtonIcon || 'https://images.wikia.nocookie.net/dev/images/a/af/Gallery-add-photo.gif',
            galleryButtonIconHidden = window.galleryButtonIconHidden || false;
        if (galleryButtonIconHidden) {
            $('.wikia-photogallery-add').text(galleryButtonText);
        } else {
            $('.wikia-photogallery-add').html('<img src="' + galleryButtonIcon + '" />&nbsp;' + galleryButtonText);
        }
    }
}(jQuery));
/**********************************************************************************************/
/**********************************************************************************************/
/**********************************************************************************************/

/************************************/
/*** Автооновлення (Налаштування) ***/
/************************************/
var ajaxPages =["Спеціальна:Watchlist","Спеціальна:Contributions","Спеціальна:WikiActivity","Спеціальна:RecentChanges","Спеціальна:NewFiles"];
var AjaxRCRefreshText = 'Автооновлення сторінки';
/************************************/
/************************************/
/************************************/

/*****************/
/*** NavButton ***/
/*****************/
//Nav button hover animation
$(function($) {
	$(".NavButton").mouseleave(function(){
		$(this).find('#imove').animate({ top: '127px' }, {queue:false, duration:300});
	}).mouseenter(function(){
		$(this).find('#imove').animate({ top: '0px' }, {queue:false, duration:300});
	});
});
 
//App button hover animation
$(function($) {
	$(".AppButton").mouseleave(function(){
		$(this).find('#amove').animate({ top: '115px' }, {queue:false, duration:300});
	}).mouseenter(function(){
		$(this).find('#amove').animate({ top: '0px' }, {queue:false, duration:300});
	});
});
/*****************/
/*****************/
/*****************/

/***************************************/
/*** Автовизначення ніку користувача ***/
/***************************************/
if (wgUserName !== null) $('span.insertusername').text(wgUserName);
/***************************************/
/***************************************/
/***************************************/
// ##################################### //
// ##################################### //
// ##################################### //

// ###################### //
// ### Дрібні функції ### //
// ### Version 1.0    ### //
// ###################### //

/********************/
/*** Кнопка вгору ***/
/********************/
window.BackToTopText = 'Повернутися до початку';
/********************/
/********************/
/********************/

/*************************/
/*** Привітання форуму ***/
/*************************/
$(function() {
  $('.boards').prepend("<div class=forumwelcome style='text-align:center; color:white; text-shadow: #555 1px 1px 3px; padding:2px;'>Ласкаво просимо на форум Mass Effect Вікі<br>Це ідеальне місце, щоб почати обговорення, задати питання та поспілкуватись з спільнотою вікі.<br>Якщо це ваш перший візит на форум Mass Effect Вікі, будь ласка, натисніть на кнопку «Правила Форуму і Довідка» вище, щоб ознайомитися з роботою цього форуму і його правилами.</div>");
});
/*************************/
/*************************/
/*************************/

/***************************************/
/*** Закриття блогу для коментування ***/
/***************************************/
window.LockOldBlogs = {
    expiryDays: 30,
    expiryMessage: "Цей блог був неактивний протягом <expiryDays> днів. Прохання не редагувати його.",
    nonexpiryCategory: "Архівні блоги"
};
/***************************************/ 
/***************************************/
/***************************************/

/***********************************/
/*** Незареєстровані користувачі ***/
/***********************************/
InactiveUsers = { 
    months: 1,
    text: 'НЕАКТИВНИЙ КОРИСТУВАЧ '
};
/***********************************/ 
/***********************************/ 
/***********************************/