/* Any JavaScript here will be loaded for all users on every page load. */

/*Добавляет дополнительные "статусы" участников. Однако прав не дает.*/
 
// rights[""] = [""];
 
// Код написан: Rappy_4187 для англовики.

$(function() {
 var rights = {};
 
 //Администраторы
 
    rights["Лилия Что Растёт на Воде"]      = ["Прародительница"];
    rights["Крыло Луны"]      = ["Стражница"];
    rights["Белолистая Луна"]      = ["Аристократка"]; 
    
 //Модераторы Чата
 
    rights["Букокрылый"]      = ["Черный Демон"];