// ######################################### //
// ### Імпорт коду Дружба — це диво Вікі ### //
// ### Version 1.1                       ### //
// ######################################### //
/* Загальний імпорт коду */
importScriptPage('MediaWiki:Discussions.js');
importScriptPage('MediaWiki:ReportErrors.js');
// ######################################### //
// ######################################### //
// ######################################### //
 
// ########################################## //
// ### Нові функції Дружба — це диво Вікі ### //
// ### Version 1.1                        ### //
// ########################################## //
/* Блок рекомендації та настанови */
(function( $ ) {
    if (!$('#WikiaRail').length) { return; }
 
    $('#WikiaRail').append(
        '<section class="rail-module">' +
            '<h2 style="margin-bottom: 5px;">Рекомендації та настанови</h2>' +
            'Мета української «Дружба — це диво Вікі» — створення повноцінної, точної енциклопедії українською мовою і ніщо інше. Політика «Дружба — це диво Вікі» щодо дотримання мовних стандартів виходить з того, що зміст статей повинен бути зрозумілим і легко сприйматися усіма читачами, які володіють українською мовою.' +
            '<h2 style="margin: 5px 0;">Корисні сторінки</h2>' +
            '<ul style="list-style: square; font-size:14px; padding:0 10px; margin-left:10px;">' +
                '<li>' +
                    '<a href="/uk/wiki/Спеціальна:Templates" title="Шаблони">Шаблони</a>' +
                '</li>' +
                '<li>' +
                    '<a href="/uk/wiki/Категорія:Незавершені_статті" title="Незавершені статті">Незавершені статті</a>' +
                '</li>' +
                '<li>' +
                    '<a href="/uk/wiki/Спеціальна:Insights/wantedpages" title="Необхідні статті">Необхідні статті</a>' +
                '</li>' +
                '<li>' +
                    '<a href="/uk/wiki/Довідка:Список_статей" title="Список статей">Список статей</a>' +
                '</li>' +
                '<li>' +
                    '<a href="/uk/wiki/Дружба_— це_диво_Вікі:Правила" title="Правила">Правила</a>' +
                '</li>' +
                '<li>' +
                    '<a href="/uk/wiki/Дружба_— це_диво_Вікі:Discord" title="Правила чату">Правила чату</a>' +
                '</li>' +
            '</ul>' +
        '</section>'
    );
})( this.jQuery );
// ######################################### //
// ######################################### //
// ######################################### //