/* Размещённый здесь код JavaScript будет загружаться пользователям при обращении к каждой странице */

//------------------------------------//
nkch_gst_gadgets = [{
    name: "RWA", // название гаджета с MediaWiki:Gadget-Название; обязательно
    title: "Недавняя вики-деятельность", // Название в меню
    description: "Недавняя вики-деятельность" // Описание гаджета в меню при наведении
}, {
    name: "ModernProfile",
    title: "Современный профиль",
    description: "Современный профиль"
}, {
    name: "UWStyle",
    title: "Единый стиль вики",
    description: "Общее оформление The Sims Вики"
}, {
    name: "Cursor",
    title: "Тематичческий курсор",
    description: "Тематические курсор"
}, {
    name: "MultiUpload",
    title: "Выбрать несколько файлов",
    description: "Загрузить несколько файлов на вики"
}, {
    name: "UCXSearch",
    title: "Быстрый поиск",
    description: "Поисковая строка в локальном меню без модального окна"
}];