/* 这里的任何JavaScript将为所有用户在每次页面载入时加载。 */
window.quizName = "火车基础知识小测试";
window.quizLang = "zh-hans";
window.resultsTextArray = [ 
	"不是吧？你真的是来玩火车的吗？（所有答案在本wiki里都可以找到）",
    "拜托，你真的有好好看wiki的资料吗= =（所有答案在本wiki里都可以找到）",
    "你了解的还不够多哦，继续加油（所有答案在本wiki里都可以找到）",
    "恭喜你及格啦，不过还有很多内容等着你去了解哦。---这里为你送上SS必得10连礼包通用码：qhvNUYjc；SS的PT+赌场币：pivNGWjJ",
    "你，你真的是新人吗？！---SS必得10连礼包通用码：qhvNUYjc；SS的PT+赌场币：pivNGWjJ" 
];
window.questions = [
    ["以下哪个对角色的战力提升影响最大？",
    "角色HP",
    "角色等级",
    "角色齿轮",
    "角色好感度",
    "角色装备"], 

    ["以下哪个会影响异常状态(debuff)的成功率？",
    "幸运",
    "命中",
    "速度",
    "回复",
    "今日抽卡的出货率"],

    ["对于快速提升能力和练度，最重要的装备是什么？",
    "赌场套装",
    "百鬼套装",
    "SS装备",
    "氪金装备",
    "特铁套装"],
    
    ["奥义技能充能为3层时，会造成多少伤害？",
    "造成40%伤害",
    "造成10%伤害",
    "造成20%伤害",
    "造成100%伤害",
    "造成150%伤害"],
    
    ["以下哪个是不氪金获取通用齿轮的主要手段？",
    "刷2-5",
    "刷6-5",
    "刷12-5",
    "刷活动图",
    "别骗我，只能氪金获得"],
    
     ["以下哪个是火车最稀缺的资源？",
    "技能觉醒书",
    "金币",
    "赌场币",
    "技能觉醒素材石头",
    "PT强化石",
    "通用齿轮"],
    
    ["火系法师最合适的武器装备是？（默认所有装备均为1孔位）",
    "S杖+火属性增伤",
    "SS杖+100魔攻",
    "S杖+100魔攻",
    "特铁装备",
    "SS杖+魔法伤害提升（小）",
    "SSS杖"],
    
    ["假设一名角色，一技能SP消耗为3，二技能SP消耗为9，三技能SP消耗为12，携带追加技能SP消耗为9，在第一回合全力auto状态下最先使用的技能是？",
    "追加技能",
    "一技能",
    "二技能",
    "三技能",
    "普通攻击"],
    
     ["假设一名角色，一技能SP消耗为6，二技能SP消耗为10，三技能SP消耗为12，携带追加技能SP消耗为12，在第一回合限制auto状态下最先使用的技能是？",
    "普通攻击",
    "一技能",
    "二技能",
    "三技能",
    "追加技能"],
    
    ["请问以下哪种情况下，角色的出手顺序为第一",
    "开启无我(trance)状态",
    "使用先手技能",
    "触发了连携(connect)",
    "速度为全场最快"],
    
    ["高难计算题：假设一名角色，一技能SP消耗为4，二技能SP消耗为6，三技能SP消耗为11，携带追加技能SP消耗为5，假设每个回合都成功出手，在全力auto中，第三回合的行动是？",
    "使用一技能",
    "使用追加技能",
    "使用二技能",
    "使用三技能",
    "普通攻击"],
];
importArticles({
    type: 'script',
    articles: [
        'u:dev:Quiz/code.js'
    ]
});